/* ২৫. আসকে আমার মন ভালো নেই -- এই কথা ৩৯ বার আউটপুট হিসেবে দেখাও।

২৬. while লুপ কিভাবে কাজ করে

২৭. for লুপ কিভাবে কাজ করে

২৮. while লুপ এর মধ্যে লুপ ভেরিয়েবল চেইঞ্জ না করলে কি সমস্যা হয়।

২৯. একটা কোড লিখে ৫৮ থেকে ৯৮ পর্যন্ত যত সংখ্যা আছে সেগুলাকে দেখাও

৩০.একটা কোড লিখে ৪১২ থেকে ৪৫৬ পর্যন্ত যত জোর সংখ্যা আছে সেগুলাকে দেখাও

৩১. একটা কোড লিখে ৫৮১ থেকে ৬২৩ পর্যন্ত যত বিজোড় সংখ্যা আছে সেগুলাকে দেখাও

৩২.while আর for loop এর মধ্যে পার্থক্য কি

৩৩ তুমি এতদিন যা যা জিনিস শিখছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা for লুপ দিয়ে সেই array এর সব উপাদান কে আউটপুট হিসেবে দেখাও।

৩৪. তুমি এতদিন পর্যন্ত যে যে মডেলের মোবাইল ফোন ইউজ করেছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা while লুপ দিয়ে সেই array এর উপাদান গুলা একটা একটা করে আউটপুট হিসেবে দেখাও

৩৫. একটা ফর লুপ চালাও। ৩০ থেকে ৮৬ পর্যন্ত। আর এই লুপ ৪৪ এ গেলে ব্রেক করবে। সেই জিনিস কোড করে দেখাও

৩৬. তোমার যত বই আছে সেগুলার দাম নিয়ে একটা array লিখে ফেলো। যে বই গুলোর দাম ২০০ টাকার উপরে সেগুলাকে স্কিপ করবে। অর্থাৎ সেগুলাকে আউটপুট হিসেবে দেখাবে না। বাকিদের কে আউটপুট হিসেবে দেখাবে। দেখো করতে পারো কিনা। */

//25

/* for (i=1; i<=39; i++){
    console.log(i, 'Ajke amar mon valo nei');
} */

//26

/* var i = 1;

while (i<=39){
    console.log(i, 'Hello World');
    i++ 
} */

//29 একটা কোড লিখে ৫৮ থেকে ৯৮ পর্যন্ত যত সংখ্যা আছে সেগুলাকে দেখাও

/* for (i = 58; i <= 98; i++) {
    console.log(i);
    
} */

//৩০.একটা কোড লিখে ৪১২ থেকে ৪৫৬ পর্যন্ত যত জোর সংখ্যা আছে সেগুলাকে দেখাও
/* var number = 412;
while(number>=412 && number<=456){
    console.log(number);
    number+=2;
} */

/* for (i=412; i>=412 && i<=456; i+=2){
    console.log(i);
    
} */

/* for (i=412; i>=412 && i<=456; i+=2){
  if (i % 2 === 0){
    console.log(i); 
  }  
} */

//৩১. একটা কোড লিখে ৫৮১ থেকে ৬২৩ পর্যন্ত যত বিজোড় সংখ্যা আছে সেগুলাকে দেখাও

/* for (i=581; i>=581 && i<=623; i+=2){
    console.log(i);
    
} */

/* for (i=581; i>=581 && i<=623; i+=2){
  if (i % 2 !== 0){
    console.log(i);
  }
} */

/* var i=581;
while(i>=581 && i<=623){
    console.log(i);
    i+=2
} */


//৩৩ তুমি এতদিন যা যা জিনিস শিখছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা for লুপ দিয়ে সেই array এর সব উপাদান কে আউটপুট হিসেবে দেখাও।

/* var learnCode = ['HTML', 'CSS', 'Bootstrap', 'Tailwind', 'Responsive Design', 'Javascript'];

for (var i = 0; i < learnCode.length; i++) {
  console.log(learnCode[i]);
} */


//৩৪. তুমি এতদিন পর্যন্ত যে যে মডেলের মোবাইল ফোন ইউজ করেছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা while লুপ দিয়ে সেই array এর উপাদান গুলা একটা একটা করে আউটপুট হিসেবে দেখাও

/* var mobile = ['iphone','samsung', 'xiaomi', 'realme', 'one+']
var i = 0;

while (i < mobile.length) {
  console.log(mobile[i]);
  i++;
} */

//৩৫. একটা ফর লুপ চালাও। ৩০ থেকে ৮৬ পর্যন্ত। আর এই লুপ ৪৪ এ গেলে ব্রেক করবে। সেই জিনিস কোড করে দেখাও

/* for (var i = 30; i <= 86; i++) {
  if (i == 44) {
    break
  }
  console.log(i);
} */

//৩৬. তোমার যত বই আছে সেগুলার দাম নিয়ে একটা array লিখে ফেলো। যে বই গুলোর দাম ২০০ টাকার উপরে সেগুলাকে স্কিপ করবে। অর্থাৎ সেগুলাকে আউটপুট হিসেবে দেখাবে না। বাকিদের কে আউটপুট হিসেবে দেখাবে। দেখো করতে পারো কিনা।

/* var bookPrice = [80, 90, 120, 220, 180, 240, 160, 190]

for (var i = 0; i < bookPrice.length; i++) {
  if (bookPrice[i] > 200) {
    continue;
  }
  console.log(bookPrice[i]);
} */
